# Використовуємо офіційний легкий образ Python
FROM python:3.10-slim

# Встановлюємо робочу директорію всередині контейнера
WORKDIR /app

# Копіюємо файл із залежностями
COPY requirements.txt .

# Встановлюємо всі необхідні бібліотеки
RUN pip install --no-cache-dir -r requirements.txt

# Копіюємо весь інший код нашого проєкту в контейнер
COPY . .

# Вказуємо порт, на якому буде працювати додаток
EXPOSE 8000

# Команда для запуску сервера
CMD ["uvicorn", "main:app", "--host", "0.0.0.0", "--port", "8000"]